## Create
### Series, DataFrame

In [2]:
s = pd.Series([1, 4, 4 ,np.nan , 5])
s

0    1.0
1    4.0
2    4.0
3    NaN
4    5.0
dtype: float64

In [7]:
dates = pd.date_range('20180101', periods=6, freq='M')
dates

DatetimeIndex(['2018-01-31', '2018-02-28', '2018-03-31', '2018-04-30',
               '2018-05-31', '2018-06-30'],
              dtype='datetime64[ns]', freq='M')

In [17]:
df = pd.DataFrame(np.random.randint(-5, 5, size=(6, 4)),
                  index=dates, columns=list('ABCD'))
df

            A  B  C  D
2018-01-31 -1 -3  1  2
2018-02-28  3  1 -5  0
2018-03-31 -5  3  0  4
2018-04-30 -5 -1 -2  3
2018-05-31  3 -3 -2  2
2018-06-30 -3 -1  3  1

In [25]:
df2 = pd.DataFrame({'A': 1.,
                   'B' : pd.Timestamp('20180101'),
                   'C' : pd.Series(1, index=list(range(4)), dtype='float32'),
                   'D' : np.array([3] * 4, dtype='int32'),
                   'E' : pd.Categorical(["test", "a"]*2),
                   'F' : 'foo' })
df2

     A          B    C  D     E    F
0  1.0 2018-01-01  1.0  3  test  foo
1  1.0 2018-01-01  1.0  3     a  foo
2  1.0 2018-01-01  1.0  3  test  foo
3  1.0 2018-01-01  1.0  3     a  foo

In [26]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [32]:
df.describe()
# df.T

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -1.333333 -0.666667 -0.833333  2.000000
std    3.669696  2.338090  2.786874  1.414214
min   -5.000000 -3.000000 -5.000000  0.000000
25%   -4.500000 -2.500000 -2.000000  1.250000
50%   -2.000000 -1.000000 -1.000000  2.000000
75%    2.000000  0.500000  0.750000  2.750000
max    3.000000  3.000000  3.000000  4.000000

### Selection

In [36]:
df['A'].reset_index()

       index  A
0 2018-01-31 -1
1 2018-02-28  3
2 2018-03-31 -5
3 2018-04-30 -5
4 2018-05-31  3
5 2018-06-30 -3

#### selection by Label

In [39]:
df.loc[dates[0]].reset_index()

  index  2018-01-31 00:00:00
0     A                   -1
1     B                   -3
2     C                    1
3     D                    2

In [43]:
df.loc['20180102':'20180331', ['A', 'B']]

            A  B
2018-01-31 -1 -3
2018-02-28  3  1
2018-03-31 -5  3

## .at : much faster than loc
- it gets one value

In [44]:
df.at[dates[0], 'B']

-3

### .iloc 
- able to use number to index

### .iat
- mix iloc & at

In [53]:
df.iloc[3].reset_index() # 0부터

  index  2018-04-30 00:00:00
0     A                   -5
1     B                   -1
2     C                   -2
3     D                    3

In [61]:
df.iloc[3:4, :]

            A  B  C  D
2018-04-30 -5 -1 -2  3

In [58]:
df.iloc[[0, 3, 1], [1, 2]] #하나씩 지정 [ [행], [열] ]

            B  C
2018-01-31 -3  1
2018-04-30 -1 -2
2018-02-28  1 -5

In [62]:
df.iat[2, 3]

4

### Boolean indexing

In [65]:
df.A>0

2018-01-31    False
2018-02-28     True
2018-03-31    False
2018-04-30    False
2018-05-31     True
2018-06-30    False
Freq: M, Name: A, dtype: bool

#### Boolean을 이용하여 원하는 값만 표현 가능
- NaN  값 자동 생략

In [67]:
df[df.A>0]

            A  B  C  D
2018-02-28  3  1 -5  0
2018-05-31  3 -3 -2  2

In [68]:
df[df>0]

              A    B    C    D
2018-01-31  NaN  NaN  1.0  2.0
2018-02-28  3.0  1.0  NaN  NaN
2018-03-31  NaN  3.0  NaN  4.0
2018-04-30  NaN  NaN  NaN  3.0
2018-05-31  3.0  NaN  NaN  2.0
2018-06-30  NaN  NaN  3.0  1.0

### isin method
able to use like boolean indexing

In [70]:
df2 = df.copy()
df2['E'] = ['one' ,'two' ] *3
df2

            A  B  C  D    E
2018-01-31 -1 -3  1  2  one
2018-02-28  3  1 -5  0  two
2018-03-31 -5  3  0  4  one
2018-04-30 -5 -1 -2  3  two
2018-05-31  3 -3 -2  2  one
2018-06-30 -3 -1  3  1  two

In [72]:
df2['E'].isin(['two', 'four']).reset_index()

       index      E
0 2018-01-31  False
1 2018-02-28   True
2 2018-03-31  False
3 2018-04-30   True
4 2018-05-31  False
5 2018-06-30   True

In [73]:
df2[df2['E'].isin(['two', 'four'])]

            A  B  C  D    E
2018-02-28  3  1 -5  0  two
2018-04-30 -5 -1 -2  3  two
2018-06-30 -3 -1  3  1  two

### Setting
- control data

In [90]:
# create new Series
s1 = pd.Series([1,2,3,4,5,6], 
               index=pd.date_range('20180302', periods=6, freq='M'))
s1.reset_index()

       index  0
0 2018-03-31  1
1 2018-04-30  2
2 2018-05-31  3
3 2018-06-30  4
4 2018-07-31  5
5 2018-08-31  6

In [91]:
# create new column in 'df' as s1
df['F'] = s1
df

            A  B  C  D    F
2018-01-31 -1 -3  1  2  NaN
2018-02-28  3  1 -5  0  NaN
2018-03-31 -5  3  0  4  1.0
2018-04-30 -5 -1 -2  3  2.0
2018-05-31  3 -3 -2  2  3.0
2018-06-30 -3 -1  3  1  4.0

use setting

In [93]:
df.iat[0, 4] = 0 # NaN -> 0
df

            A  B  C  D    F
2018-01-31 -1 -3  1  2  0.0
2018-02-28  3  1 -5  0  NaN
2018-03-31 -5  3  0  4  1.0
2018-04-30 -5 -1 -2  3  2.0
2018-05-31  3 -3 -2  2  3.0
2018-06-30 -3 -1  3  1  4.0

In [94]:
df.loc[:, 'D'] = np.array([5] * len(df)) # put '5' on D column
df

            A  B  C  D    F
2018-01-31 -1 -3  1  5  0.0
2018-02-28  3  1 -5  5  NaN
2018-03-31 -5  3  0  5  1.0
2018-04-30 -5 -1 -2  5  2.0
2018-05-31  3 -3 -2  5  3.0
2018-06-30 -3 -1  3  5  4.0

In [100]:
df2 = df.copy()
df2[df2>0] = -df2
df2

            A  B  C  D    F
2018-01-31 -1 -3 -1 -5  0.0
2018-02-28 -3 -1 -5 -5  NaN
2018-03-31 -5 -3  0 -5 -1.0
2018-04-30 -5 -1 -2 -5 -2.0
2018-05-31 -3 -3 -2 -5 -3.0
2018-06-30 -3 -1 -3 -5 -4.0

### Missing Data

In [101]:
df

            A  B  C  D    F
2018-01-31 -1 -3  1  5  0.0
2018-02-28  3  1 -5  5  NaN
2018-03-31 -5  3  0  5  1.0
2018-04-30 -5 -1 -2  5  2.0
2018-05-31  3 -3 -2  5  3.0
2018-06-30 -3 -1  3  5  4.0

In [114]:
df1 = df.reindex(index=dates[0:4], columns = list(df.columns)+['E'])
df1

            A  B  C  D    F   E
2018-01-31 -1 -3  1  5  0.0 NaN
2018-02-28  3  1 -5  5  NaN NaN
2018-03-31 -5  3  0  5  1.0 NaN
2018-04-30 -5 -1 -2  5  2.0 NaN

In [122]:
# df1.loc[dates[0]:dates[1], 'E'] = 3, 5
df1.loc[dates[0]:dates[1], 'E'] = [1, 2]
# df1.loc[dates[0]:dates[1], 'E'] = None
df1

            A  B  C  D    F    E
2018-01-31 -1 -3  1  5  0.0  1.0
2018-02-28  3  1 -5  5  NaN  2.0
2018-03-31 -5  3  0  5  1.0  NaN
2018-04-30 -5 -1 -2  5  2.0  NaN

### .dropna 
- drop row which has NaN data
- option (how = 'all' or 'any')
- switch c or row (axis = 1 or 0)

In [123]:
df1.dropna(how='any')

            A  B  C  D    F    E
2018-01-31 -1 -3  1  5  0.0  1.0

In [125]:
df1.iloc[0] = np.nan
df1

              A    B    C    D    F    E
2018-01-31  NaN  NaN  NaN  NaN  NaN  NaN
2018-02-28  3.0  1.0 -5.0  5.0  NaN  2.0
2018-03-31 -5.0  3.0  0.0  5.0  1.0  NaN
2018-04-30 -5.0 -1.0 -2.0  5.0  2.0  NaN

In [126]:
df1.dropna(how='all')

              A    B    C    D    F    E
2018-02-28  3.0  1.0 -5.0  5.0  NaN  2.0
2018-03-31 -5.0  3.0  0.0  5.0  1.0  NaN
2018-04-30 -5.0 -1.0 -2.0  5.0  2.0  NaN

In [128]:
df1["F"] = np.nan
df1

              A    B    C    D   F    E
2018-01-31  NaN  NaN  NaN  NaN NaN  NaN
2018-02-28  3.0  1.0 -5.0  5.0 NaN  2.0
2018-03-31 -5.0  3.0  0.0  5.0 NaN  NaN
2018-04-30 -5.0 -1.0 -2.0  5.0 NaN  NaN

In [129]:
df1.dropna(how='all', axis=1)

              A    B    C    D    E
2018-01-31  NaN  NaN  NaN  NaN  NaN
2018-02-28  3.0  1.0 -5.0  5.0  2.0
2018-03-31 -5.0  3.0  0.0  5.0  NaN
2018-04-30 -5.0 -1.0 -2.0  5.0  NaN

### .fillna
fill na by value

In [130]:
df1.fillna(value=5)

              A    B    C    D    F    E
2018-01-31  5.0  5.0  5.0  5.0  5.0  5.0
2018-02-28  3.0  1.0 -5.0  5.0  5.0  2.0
2018-03-31 -5.0  3.0  0.0  5.0  5.0  5.0
2018-04-30 -5.0 -1.0 -2.0  5.0  5.0  5.0

### Stats
.mean() - axis 0: columns mean, 1:rows

In [137]:
df.mean().reset_index().round(2)

  index     0
0     A -1.33
1     B -0.67
2     C -0.83
3     D  5.00
4     F  2.00

In [139]:
df.mean(1).reset_index().round(2)

       index    0
0 2018-01-31  0.4
1 2018-02-28  1.0
2 2018-03-31  0.8
3 2018-04-30 -0.2
4 2018-05-31  1.2
5 2018-06-30  1.6

In [133]:
df.median().reset_index()

  index    0
0     A -2.0
1     B -1.0
2     C -1.0
3     D  5.0
4     F  2.0

### shift

In [151]:
s = pd.Series([1, 3, 4, np.nan, 5,4], index=dates)
print(s, "\n")
print(s.shift(2))

2018-01-31    1.0
2018-02-28    3.0
2018-03-31    4.0
2018-04-30    NaN
2018-05-31    5.0
2018-06-30    4.0
Freq: M, dtype: float64

2018-01-31    NaN
2018-02-28    NaN
2018-03-31    1.0
2018-04-30    3.0
2018-05-31    4.0
2018-06-30    NaN
Freq: M, dtype: float64

In [152]:
df

            A  B  C  D    F
2018-01-31 -1 -3  1  5  0.0
2018-02-28  3  1 -5  5  NaN
2018-03-31 -5  3  0  5  1.0
2018-04-30 -5 -1 -2  5  2.0
2018-05-31  3 -3 -2  5  3.0
2018-06-30 -3 -1  3  5  4.0

In [157]:
print(s)
df.sub(s,axis='index')

2018-01-31    1.0
2018-02-28    3.0
2018-03-31    4.0
2018-04-30    NaN
2018-05-31    5.0
2018-06-30    4.0
Freq: M, dtype: float64

              A    B    C    D    F
2018-01-31 -2.0 -4.0  0.0  4.0 -1.0
2018-02-28  0.0 -2.0 -8.0  2.0  NaN
2018-03-31 -9.0 -1.0 -4.0  1.0 -3.0
2018-04-30  NaN  NaN  NaN  NaN  NaN
2018-05-31 -2.0 -8.0 -7.0  0.0 -2.0
2018-06-30 -7.0 -5.0 -1.0  1.0  0.0

### Histogramming

In [158]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    4
1    0
2    6
3    5
4    2
5    3
6    2
7    1
8    3
9    0
dtype: int64

In [159]:
s.value_counts()

3    2
2    2
0    2
6    1
5    1
4    1
1    1
dtype: int64

In [160]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'DD', np.nan, 'SS', 'dog'])
s.str.lower()

0       a
1       b
2       c
3    aaba
4      dd
5     NaN
6      ss
7     dog
dtype: object

In [161]:
_.str.upper()

0       A
1       B
2       C
3    AABA
4      DD
5     NaN
6      SS
7     DOG
dtype: object

In [162]:
_.str.len()

0    1.0
1    1.0
2    1.0
3    4.0
4    2.0
5    NaN
6    2.0
7    3.0
dtype: float64

### stack, multiIndex

In [163]:
list(zip([1, 2, 3], [4, 4, 4], [1, 4, 6]))

[(1, 4, 1), (2, 4, 4), (3, 4, 6)]

In [164]:
tuples = list(zip(['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
                  ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']))
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

### index변수에 MultiIndex 설정

In [165]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
index

MultiIndex(levels=[['bar', 'baz', 'foo', 'qux'], ['one', 'two']],
           labels=[[0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 0, 1, 0, 1, 0, 1]],
           names=['first', 'second'])

In [167]:
df = pd.DataFrame(np.random.randint(10, size=(8, 2)),
                 index=index, columns= ['A', 'B'])
df

              A  B
first second
bar   one     1  7
      two     0  6
baz   one     6  5
      two     3  3
foo   one     0  5
      two     2  3
qux   one     2  3
      two     6  8

In [168]:
df2 = df[:4]
df2

              A  B
first second
bar   one     1  7
      two     0  6
baz   one     6  5
      two     3  3

In [177]:
stacked = df2.stack()
stacked

first  second
bar    one     A    1
               B    7
       two     A    0
               B    6
baz    one     A    6
               B    5
       two     A    3
               B    3
dtype: int64

In [173]:
stacked.unstack()

              A  B
first second
bar   one     1  7
      two     0  6
baz   one     6  5
      two     3  3

In [189]:
stacked.unstack(0)

first     bar  baz
second
one    A  1.0  6.0
       B  7.0  5.0
two    A  0.0  3.0
       B  6.0  3.0

Time Series

In [190]:
mg = pd.date_range('2018-01-01', periods=100, freq='Min')